Latihan_ci4/app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'muhammad'
 LIMIT 1
INSERT INTO `user` (`username`, `password`, `role`, `is_aktif`) VALUES ('muhammad', '5f4dcc3b5aa765d61d8327deb882cf99', 'user', 1)
---
			public function register()
			{
				if ($this->request->getPost()) {
					$username = $this->request->getVar('username');
					$password = $this->request->getVar('password');
					$dataUser = $this->user->where(['username' => $username])->first();
					if ($dataUser) {
						session()->setFlashdata('errors', 'Username already exists');
						return redirect()->back();
					}

					$userData = [
						'username' => $username,
						'password' => md5($password),
						'role'		=> "user",
						'is_aktif' => true,
					];

					$this->user->insert($userData);